trade_exp/src/DataProcessors/РабочееМестоОператораCallЦентра/РабочееМестоОператораCallЦентра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоОператораCallЦентра</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ЧерныйСписокКонтактов/ЧерныйСписокКонтактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c401f29d-dc39-464e-9e33-484e3a027e14">
  <name>ЧерныйСписокКонтактов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="4b7610f3-e507-4d1b-b2d4-475c338981ab">
    <name>КонтактныеДанные</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="fa319de3-3094-443c-b8f0-1b3ab6c81d1d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c7e0bb70-a2e6-43e1-b2ac-14a2265c58b5">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СобытияОбъектовАльтерра/СобытияОбъектовАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e70f20ec-7ffe-4467-9958-8ee45b3ba97e">
  <name>СобытияОбъектовАльтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions extendedConfigurationObject="9d6673f6-d579-46b5-8c82-6134e22aff40">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bf1bcf04-f54e-4486-b6f2-435be7f36471">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДанныеЗвонков/ДанныеЗвонков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="002120ec-2048-4df8-bde9-2ed5c3c452a2">
  <name>ДанныеЗвонков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="4bca3e4d-5694-4e91-a850-7818202469f7">
    <name>ВходящееИсходящее</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b789329f-fb13-4104-ae9a-5dcf2cba79d9">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="6ec7073d-75da-4234-ba8a-7d41e623aab2">
    <name>НачалоРазговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0273427f-ff84-4688-b397-bb838236eab5">
    <name>ДлительностьРазговора</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="708b88f0-68ba-4a65-98bb-4dafa7000d8c">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5fba01f3-ba7e-4763-a5a4-ef306a0ec61e">
    <name>Неотвеченный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="23ea8d14-b887-4666-9f12-59bec5087c6f">
    <name>НомерКому</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="f749a7a6-8cc6-4082-9c50-339d948a5764">
    <name>НомерОтКого</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3b2ac32f-d706-4724-9640-7b336db74cb0">
    <name>НомерОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="751e9be7-af64-4394-b9ca-bbc54b90d06e">
    <name>СсылкаНаЗаписьРазговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2ea40f78-0909-46d3-97eb-c2fea80138bf">
    <name>ВызовЗавершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="89e20d88-238a-44b1-9475-9fc18e90665b">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5808b821-dba4-482d-8f26-8cfb9bc4c37c">
    <name>ТребуетсяЗапроситьЗаписьРазговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="00136b9e-65d2-4462-ab6a-b716e26c2279">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="82d85b47-e000-482b-b428-ae1ea1746e60">
    <name>ИдентификаторЗвонкаВАТС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="0e0c77c6-fa1a-4050-984b-7b6c32ff31ed">
    <name>УникальныйИдентификаторБД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДанныеОбзвонов/ДанныеОбзвонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6f111f6a-958a-4b3a-9a75-6a707eaf8554">
  <name>ДанныеОбзвонов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="323e441b-3165-421f-a733-a90134867003">
    <name>НомерТелефона</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="082dcc11-761b-4227-920b-bb413d9fcd8b">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="95f0c8c7-69ff-4061-af04-3e92b5e4e552">
    <name>Оценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="008336a3-ae9f-49c9-9f70-144e6f50f21b">
    <name>ОценкаКачестваДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="5e5cc76f-03c4-4fb5-b318-ae8527ec7a6f">
    <name>Примечание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="0126f346-11ce-499e-a2a1-9d53880a81e1">
    <name>ОбъектОбзвона</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2224e507-f0ae-4580-88f8-b369e0c759fb">
    <name>ВидОбзвона</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ca5eda48-3440-4dad-94f8-7b659598e611">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ВидыОбзвонов/ВидыОбзвонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="039db534-5b9e-4b0b-aeae-7ca48634112a">
  <name>ВидыОбзвонов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="92693fff-12c1-4ddd-b6bf-a25f4bb21289">
    <name>ОбзвонКачестваДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="06f1f07c-14dd-4f20-a447-27398974faac">
    <name>ОбзвонКачестваКрупныхПокупок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3333bba5-5597-496e-9cb9-ba1a6fea9c05">
    <name>ОбзвонУдобстваРаботыВИМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c03a1571-d35f-40e2-a39a-3c91cef19465">
    <name>ОбзвонПричинВозвратаТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ef1c0374-9e7e-4513-965d-6bbd48cde9de">
    <name>ОбзвонКачестваРаботыОператораКЦПоЗвонку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b629c5b7-a49e-481e-a419-4dbba7e62e2d">
    <name>ОбзвонКачестваРаботыКорзинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e488bdf0-6294-4fb3-b16f-cb2c58cb03c5">
    <name>ОбзвонКачестваРаботыОсновногоМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ОценкиКлиентов/ОценкиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ff8ac20e-8b5e-4e9b-8bd4-972faf1fe002">
  <name>ОценкиКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="758e5b6f-b013-4ec0-b16f-224bb3f501b9">
    <name>НетОценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="05abad29-9529-49b8-9229-1d205e2a898a">
    <name>Единица</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="17050b00-ac13-49ac-bf72-478598676508">
    <name>Двойка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d756f9ed-d711-4dfd-ad7a-76ac9934ab7a">
    <name>Тройка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="679b20cc-23a7-4c53-9740-fbfa4d0fa7cd">
    <name>Четверка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e2cbda44-7c8c-4193-a8a4-35f350f3ed9e">
    <name>Пятерка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="922d8d3c-6453-4f72-8b1e-9ea8a13715d2">
    <name>Шестерка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4660d06d-e9f9-4dad-b63c-284d12a80d7a">
    <name>Семерка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4f260836-47ee-4aa5-bf1e-494f9617288c">
    <name>Восьмерка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3e1db765-da8c-4410-a940-cb80cdf54991">
    <name>Девятка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1bd77a72-fc0c-4075-8d50-4c26430bb775">
    <name>Десятка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/КомпанияЧастноеЛицо/КомпанияЧастноеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КомпанияЧастноеЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="640f3f70-7e8d-48fb-8487-fda65cb57f60">
    <name>ЧастноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af9cb34d-d5ea-4de1-a7d6-999e6bd67541">
    <name>Компания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/DataProcessors/РабочееМестоОператораCallЦентра/ManagerModule.bsl
&НаСервере
Процедура СохранитьВExcelНаСервере(ТаблицаЗначений,ПапкаДляВыгрузки, ВидОбзвона, Фильтр = "") Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент();
	МакетОбработки = ПолучитьМакет("Обзвоны");
	
	Если ВидОбзвона = Перечисления.ВидыОбзвонов.ОбзвонКачестваДоставки Тогда
		
		ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("ЗаголовокСФильтром");
		ОбластьЗаголовок.Параметры.Фильтр = Фильтр;
		ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка"); 
		ОбластьСтрока = МакетОбработки.ПолучитьОбласть("Строка"); 
			
	ИначеЕсли ВидОбзвона = Перечисления.ВидыОбзвонов.ОбзвонКачестваКрупныхПокупок Тогда
		
		ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("ЗаголовокСФильтром");
		ОбластьЗаголовок.Параметры.Фильтр = Фильтр;
		ОбластьШапка = МакетОбработки.ПолучитьОбласть("ШапкаКрупныеПокупки"); 
		ОбластьСтрока = МакетОбработки.ПолучитьОбласть("СтрокаКрупныеПокупки"); 
		
	ИначеЕсли ВидОбзвона = Перечисления.ВидыОбзвонов.ОбзвонКачестваРаботыКорзинки Тогда
		
		ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("ЗаголовокСФильтром");
		ОбластьЗаголовок.Параметры.Фильтр = Фильтр;
		ОбластьШапка = МакетОбработки.ПолучитьОбласть("ШапкаКрупныеПокупки"); 
		ОбластьСтрока = МакетОбработки.ПолучитьОбласть("СтрокаКрупныеПокупки");	
		
	ИначеЕсли ВидОбзвона = Перечисления.ВидыОбзвонов.ОбзвонКачестваРаботыОператораКЦПоЗвонку Тогда
		
		ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("ЗаголовокСФильтром");
		ОбластьЗаголовок.Параметры.Фильтр = Фильтр;
		ОбластьШапка = МакетОбработки.ПолучитьОбласть("ШапкаКачествоРаботыКЦ"); 
		ОбластьСтрока = МакетОбработки.ПолучитьОбласть("СтрокаКачествоРаботыКЦ");
		
	ИначеЕсли ВидОбзвона = Перечисления.ВидыОбзвонов.ОбзвонКачестваРаботыОсновногоМенеджера Тогда
	
		ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("ЗаголовокСФильтром");
		ОбластьШапка = МакетОбработки.ПолучитьОбласть("ШапкаРаботаКорзинки"); 
		ОбластьСтрока = МакетОбработки.ПолучитьОбласть("СтрокаРаботаКорзинки"); 
		
	ИначеЕсли ВидОбзвона = Перечисления.ВидыОбзвонов.ОбзвонПричинВозвратаТовара Тогда
		
		ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("ЗаголовокСФильтром");
		ОбластьЗаголовок.Параметры.Фильтр = Фильтр;
		ОбластьШапка = МакетОбработки.ПолучитьОбласть("ШапкаПричиныВозврата"); 
		ОбластьСтрока = МакетОбработки.ПолучитьОбласть("СтрокаПричиныВозврата"); 
		
	ИначеЕсли ВидОбзвона = Перечисления.ВидыОбзвонов.ОбзвонУдобстваРаботыВИМ Тогда
		
		ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("ЗаголовокБезФильтра");
		ОбластьЗаголовок.Параметры.ВидОбзвона = ВидОбзвона;
		ОбластьШапка = МакетОбработки.ПолучитьОбласть("ШапкаУдобствоРаботыВИМ"); 
		ОбластьСтрока = МакетОбработки.ПолучитьОбласть("СтрокаУдобствоРаботыВИМ"); 
		
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.ВидОбзвона = ВидОбзвона;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьШапка);
		
	Для каждого Стр Из ТаблицаЗначений Цикл
	
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,Стр);  
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	
	КонецЦикла;

	ТабличныйДокумент.Записать(ПапкаДляВыгрузки+"\"+Строка(ВидОбзвона)+"_"+Строка(Фильтр)+"_"+Строка(Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"))+".xlsx", ТипФайлаТабличногоДокумента.XLSX);

КонецПроцедуры

&НаСервере
Функция ПолучитьВыборкуЗаказовНаДоставкуДляОценки(ДатаНачала,ДатаОкончания,Подразделение) Экспорт 
		
	МассивОценок = Новый Массив;
	МассивОценок.Добавить(Перечисления.ОценкиКлиентов.Единица);
	МассивОценок.Добавить(Перечисления.ОценкиКлиентов.НетОценки);
	
	ВидЖалобы = Новый Массив;
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000003"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000002"));
	ВидЖалобы.Добавить(Справочники.ВидыОбращенийКлиентов.НайтиПоКоду("000000001"));
	
	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
//	|ПОМЕСТИТЬ ВТЧерныйСписок
//	|ИЗ
//	|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СобытияОбъектовАльтерраСрезПоследних.Объект КАК Объект
//	|ПОМЕСТИТЬ ВТ_Исключения
//	|ИЗ
//	|	РегистрСведений.СобытияОбъектовАльтерра.СрезПоследних КАК СобытияОбъектовАльтерраСрезПоследних
//	|ГДЕ
//	|	СобытияОбъектовАльтерраСрезПоследних.Событие = &Событие
//	|
//	|ОБЪЕДИНИТЬ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеЗвонков.Контрагент КАК Клиент
//	|ИЗ
//	|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
//	|ГДЕ
//	|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
//	|	И ДанныеЗвонков.ДатаСобытия > ДОБАВИТЬКДАТЕ(&Дата1, ДЕНЬ, -30)
//	|
//	|ОБЪЕДИНИТЬ
//	|
//	|ВЫБРАТЬ
//	|	ОбращениеКлиента.Клиент
//	|ИЗ
//	|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
//	|ГДЕ
//	|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
//	|	И ОбращениеКлиента.ВидЖалобы В(&ВидЖалобы)
//	|	И ОбращениеКлиента.Дата > ДОБАВИТЬКДАТЕ(&Дата1, ДЕНЬ, -30)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ ПЕРВЫЕ 20
//	|	ЗаказНаДоставкуКлиенту.Ссылка КАК ЗаказНаДоставку,
//	|	ЗаказНаДоставкуКлиенту.Дата КАК Дата,
//	|	ЗаказНаДоставкуКлиенту.Подразделение КАК Подразделение,
//	|	ЗаказНаДоставкуКлиенту.Партнер КАК ФИОКлиента,
//	|	ЗаказНаДоставкуКлиенту.ТелефонКлиента КАК НомерТелефона,
//	|	ЗаданиеНаПеревозкуРейс.Водитель КАК Водитель,
//	|	ЗаданиеНаПеревозкуРейс.Автор КАК Автор,
//	|	ЗаказНаДоставкуКлиенту.ОценкаКачестваДоставки КАК ОценкаКачестваДоставки,
//	|	ЗаказНаДоставкуКлиенту.ТелефонКлиентаНаВыгрузке КАК ТелефонКлиентаНаВыгрузке,
//	|	ЗаказНаДоставкуКлиенту.КомментарийПоДоставке КАК Комментарий,
//	|	ЗаказНаДоставкуКлиенту.ОценкаПоЗвонку КАК ОценкаПоЗвонку
//	|ИЗ
//	|	Справочник.Партнеры КАК Партнеры
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
//	|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка
//	|			И ВЫБОР
//	|					КОГДА ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ГруппыПартнеров""
//	|						ТОГДА ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица""
//	|				КОНЕЦ)
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
//	|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка                                          
//	|			И Партнеры.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
//	|			И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона = """"
//	|			И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%""
//	|			И ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
//	|			ПО ЗаданиеНаПеревозкуРейсОснования.Документ = ЗаказНаДоставкуКлиенту.Ссылка
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс КАК ЗаданиеНаПеревозкуРейс
//	|			ПО ЗаданиеНаПеревозкуРейсОснования.Ссылка = ЗаданиеНаПеревозкуРейс.Ссылка
//	|		ПО ЗаданиеНаПеревозкуРейсОснования.Документ.Партнер = Партнеры.Ссылка
//	|ГДЕ
//	|	ЗаказНаДоставкуКлиенту.Проведен 
//	|   И ЗаданиеНаПеревозкуРейс.Проведен
//	|	И ЗаказНаДоставкуКлиенту.Партнер.ЮрФизЛицо = &ЮрФизЛицо
//	|	И Не ЗаказНаДоставкуКлиенту.ОценкаКачестваДоставки В(&ОценкаКачестваДоставки)
//	|	И ЗаказНаДоставкуКлиенту.Подразделение = &Подразделение
//	|	И ЗаказНаДоставкуКлиенту.Дата МЕЖДУ &Дата1 И &Дата2
//	|	И НЕ Партнеры.Ссылка В
//	|				(ВЫБРАТЬ
//	|					ВТ_Исключения.Объект КАК Клиент
//	|				ИЗ
//	|					ВТ_Исключения)
//	|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
//	|				(ВЫБРАТЬ
//	|					ВТЧерныйСписок.Номер КАК Номер
//	|				ИЗ
//	|					ВТЧерныйСписок)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Партнер,
//	|	Дата";
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
	|ПОМЕСТИТЬ ВТЧерныйСписок
	|ИЗ
	|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияОбъектовАльтерраСрезПоследних.Объект КАК Объект
	|ПОМЕСТИТЬ ВТ_Исключения
	|ИЗ
	|	РегистрСведений.СобытияОбъектовАльтерра.СрезПоследних КАК СобытияОбъектовАльтерраСрезПоследних
	|ГДЕ
	|	СобытияОбъектовАльтерраСрезПоследних.Событие = &Событие
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеЗвонков.Контрагент
	|ИЗ
	|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
	|ГДЕ
	|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
	|	И ДанныеЗвонков.ДатаСобытия > ДОБАВИТЬКДАТЕ(&Дата1, ДЕНЬ, -30)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОбращениеКлиента.Клиент
	|ИЗ
	|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
	|ГДЕ
	|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
	|	И ОбращениеКлиента.ВидЖалобы В(&ВидЖалобы)
	|	И ОбращениеКлиента.Дата > ДОБАВИТЬКДАТЕ(&Дата1, ДЕНЬ, -30)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 20
	|	ЗаказНаДоставкуКлиенту.Ссылка КАК ЗаказНаДоставку,
	|	ЗаказНаДоставкуКлиенту.Дата КАК Дата,
	|	ЗаказНаДоставкуКлиенту.Подразделение КАК Подразделение,
	|	ЗаказНаДоставкуКлиенту.Партнер КАК ФИОКлиента,
	|	ЗаданиеНаПеревозкуРейс.Водитель КАК Водитель,
	|	ЗаданиеНаПеревозкуРейс.Автор КАК Автор,
	|	ЗаказНаДоставкуКлиенту.ОценкаКачестваДоставки КАК ОценкаКачестваДоставки,
	|	ЗаказНаДоставкуКлиенту.ТелефонКлиентаНаВыгрузке КАК ТелефонКлиентаНаВыгрузке,
	|	ДанныеОбзвонов.Оценка КАК ОценкаПоЗвонку,
	|	ЕСТЬNULL(ДанныеОбзвонов.Комментарий, ЗаказНаДоставкуКлиенту.КомментарийПоДоставке) КАК Комментарий,
	|	ЕСТЬNULL(ДанныеОбзвонов.НомерТелефона, ЗаказНаДоставкуКлиенту.ТелефонКлиента) КАК НомерТелефона
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка)
	|			И (ВЫБОР
	|				КОГДА ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ГруппыПартнеров""
	|					ТОГДА ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица""
	|			КОНЕЦ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка)
	|			И (Партнеры.Ссылка.ЮрФизЛицо = &ЮрФизЛицо)
	|			И (НЕ ПартнерыКонтактнаяИнформация.НомерТелефона = """")
	|			И (ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%"")
	|			И (ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОбзвонов КАК ДанныеОбзвонов
	|				ПО (ДанныеОбзвонов.ОбъектОбзвона = ЗаказНаДоставкуКлиенту.Ссылка
	|					И ДанныеОбзвонов.ВидОбзвона = &ВидОбзвона)
	|			ПО (ЗаданиеНаПеревозкуРейсОснования.Документ = ЗаказНаДоставкуКлиенту.Ссылка)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс КАК ЗаданиеНаПеревозкуРейс
	|			ПО (ЗаданиеНаПеревозкуРейсОснования.Ссылка = ЗаданиеНаПеревозкуРейс.Ссылка)
	|		ПО (ЗаданиеНаПеревозкуРейсОснования.Документ.Партнер = Партнеры.Ссылка)
	|ГДЕ
	|	ЗаказНаДоставкуКлиенту.Проведен
	|	И ЗаданиеНаПеревозкуРейс.Проведен
	|	И ЗаказНаДоставкуКлиенту.Партнер.ЮрФизЛицо = &ЮрФизЛицо
	|	И НЕ ЗаказНаДоставкуКлиенту.ОценкаКачестваДоставки В(&ОценкаКачестваДоставки)
	|	И ЗаказНаДоставкуКлиенту.Подразделение = &Подразделение
	|	И ЗаказНаДоставкуКлиенту.Дата МЕЖДУ &Дата1 И &Дата2
	|	И НЕ Партнеры.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_Исключения.Объект КАК Клиент
	|				ИЗ
	|					ВТ_Исключения)
	|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
	|				(ВЫБРАТЬ
	|					ВТЧерныйСписок.Номер КАК Номер
	|				ИЗ
	|					ВТЧерныйСписок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИОКлиента,
	|	Дата";

	Запрос.УстановитьПараметр("ОценкаКачестваДоставки", МассивОценок); 
	Запрос.УстановитьПараметр("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаОкончания);
	Запрос.УстановитьПараметр("ВидЖалобы", ВидЖалобы);
	Запрос.УстановитьПараметр("Событие", Справочники.СобытияОбъектовАльтерра.ИсключениеПартнераИзОбзвонаПоДоставке);
	Запрос.УстановитьПараметр("ВидОбзвона", Перечисления.ВидыОбзвонов.ОбзвонКачестваДоставки);

	Результат = Запрос.Выполнить().Выгрузить();


// Ранее в 1-м запросе было условие И  ЗаказНаДоставкуКлиенту.ОценкаКачестваДоставки В(&ОценкаКачестваДоставки)
// во 2-м И НЕ ЗаказНаДоставкуКлиенту.ОценкаКачестваДоставки В(&ОценкаКачестваДоставки) 
// поскольку сейчас ОценкаКачестваДоставки не устанавливается, то второй запрос закомменчен   		
//	Если Результат.Количество()<20 Тогда
		
//		КоличествоЗаписей = 0;
//		КоличествоЗаписей = 20 - Результат.Количество();
		
//		Запрос = Новый Запрос;
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ЧерныйСписокКонтактов.КонтактныеДанные КАК Номер
//		|ПОМЕСТИТЬ ВТЧерныйСписок
//		|ИЗ
//		|	РегистрСведений.ЧерныйСписокКонтактов КАК ЧерныйСписокКонтактов
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	СобытияОбъектовАльтерраСрезПоследних.Объект КАК Объект
//		|ПОМЕСТИТЬ ВТ_Исключения
//		|ИЗ
//		|	РегистрСведений.СобытияОбъектовАльтерра.СрезПоследних КАК СобытияОбъектовАльтерраСрезПоследних
//		|ГДЕ
//		|	СобытияОбъектовАльтерраСрезПоследних.Событие = &Событие
//		|
//		|ОБЪЕДИНИТЬ
//		|
//		|ВЫБРАТЬ
//		|	ДанныеЗвонков.Контрагент
//		|ИЗ
//		|	РегистрСведений.ДанныеЗвонков КАК ДанныеЗвонков
//		|ГДЕ
//		|	ДанныеЗвонков.ВходящееИсходящее = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Исходящее)
//		|	И ДанныеЗвонков.ДатаСобытия > ДОБАВИТЬКДАТЕ(&Дата1, ДЕНЬ, -30)
//		|
//		|ОБЪЕДИНИТЬ
//		|
//		|ВЫБРАТЬ
//		|	ОбращениеКлиента.Клиент
//		|ИЗ
//		|	Документ.ОбращениеКлиента КАК ОбращениеКлиента
//		|ГДЕ
//		|	ОбращениеКлиента.ВидОбращения = ЗНАЧЕНИЕ(Перечисление.ВидыОбращений.Жалоба)
//		|	И ОбращениеКлиента.ВидЖалобы В(&ВидЖалобы)
//		|	И ОбращениеКлиента.Дата > ДОБАВИТЬКДАТЕ(&Дата1, ДЕНЬ, -30)
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ ПЕРВЫЕ "+Строка(КоличествоЗаписей)+"
//		|	ЗаказНаДоставкуКлиенту.Ссылка КАК ЗаказНаДоставку,
//		|	ЗаказНаДоставкуКлиенту.Дата КАК Дата,
//		|	ЗаказНаДоставкуКлиенту.Подразделение КАК Подразделение,
//		|	ЗаказНаДоставкуКлиенту.Партнер КАК ФИОКлиента,
//		|	ЗаказНаДоставкуКлиенту.ТелефонКлиента КАК НомерТелефона,
//		|	ЗаданиеНаПеревозкуРейс.Водитель КАК Водитель,
//		|	ЗаданиеНаПеревозкуРейс.Автор КАК Автор,
//		|	ЗаказНаДоставкуКлиенту.ОценкаКачестваДоставки КАК ОценкаКачестваДоставки,
//		|	ЗаказНаДоставкуКлиенту.ТелефонКлиентаНаВыгрузке КАК ТелефонКлиентаНаВыгрузке,
//		|	ЗаказНаДоставкуКлиенту.КомментарийПоДоставке КАК Комментарий,
//		|	ЗаказНаДоставкуКлиенту.ОценкаПоЗвонку КАК ОценкаПоЗвонку
//		|ИЗ
//		|	Справочник.Партнеры КАК Партнеры
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
//		|		ПО (ПартнерыДополнительныеРеквизиты.Ссылка = Партнеры.Ссылка
//		|			И ВЫБОР
//		|					КОГДА ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ГруппыПартнеров""
//		|						ТОГДА ПартнерыДополнительныеРеквизиты.Значение.Наименование = ""Частные лица""
//		|				КОНЕЦ)
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
//		|		ПО (ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка                                          
//		|			И Партнеры.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
//		|			И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона = """"
//		|			И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""9%""
//		|			И ДЛИНАСТРОКИ(ПартнерыКонтактнаяИнформация.НомерТелефона) = 10)
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
//		|			ПО ЗаданиеНаПеревозкуРейсОснования.Документ = ЗаказНаДоставкуКлиенту.Ссылка
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс КАК ЗаданиеНаПеревозкуРейс
//		|			ПО ЗаданиеНаПеревозкуРейсОснования.Ссылка = ЗаданиеНаПеревозкуРейс.Ссылка
//		|		ПО ЗаданиеНаПеревозкуРейсОснования.Документ.Партнер = Партнеры.Ссылка
//		|ГДЕ
//		|	ЗаказНаДоставкуКлиенту.Проведен 
//    	|   И ЗаданиеНаПеревозкуРейс.Проведен
//    	|	И ЗаказНаДоставкуКлиенту.Партнер.ЮрФизЛицо = &ЮрФизЛицо
//		|	И Не ЗаказНаДоставкуКлиенту.ОценкаКачестваДоставки В(&ОценкаКачестваДоставки)
//		|	И ЗаказНаДоставкуКлиенту.Подразделение = &Подразделение
//		|	И ЗаказНаДоставкуКлиенту.Дата МЕЖДУ &Дата1 И &Дата2
//		|	И НЕ Партнеры.Ссылка В
//		|				(ВЫБРАТЬ
//		|					ВТ_Исключения.Объект КАК Клиент
//		|				ИЗ
//		|					ВТ_Исключения)
//		|	И НЕ ПартнерыКонтактнаяИнформация.НомерТелефона В
//		|				(ВЫБРАТЬ
//		|					ВТЧерныйСписок.Номер КАК Номер
//		|				ИЗ
//		|					ВТЧерныйСписок)
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	Партнер,
//		|	Дата";

//		Запрос.УстановитьПараметр("ОценкаКачестваДоставки", МассивОценок);
//		Запрос.УстановитьПараметр("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
//		Запрос.УстановитьПараметр("Подразделение", Подразделение);
//		Запрос.УстановитьПараметр("Дата1", ДатаНачала);
//     	Запрос.УстановитьПараметр("Дата2", ДатаОкончания);
//		Запрос.УстановитьПараметр("КоличествоЗаписей", КоличествоЗаписей);
//		Запрос.УстановитьПараметр("ВидЖалобы", ВидЖалобы);
//	    Запрос.УстановитьПараметр("Событие", Справочники.СобытияОбъектовАльтерра.ИсключениеПартнераИзОбзвонаПоДоставке);
//		Запрос.УстановитьПараметр("ВидОбзвона", Перечисления.ВидыОбзвонов.ОбзвонКачестваДоставки);
//		
//		РезультатЗапроса = Запрос.Выполнить().Выбрать();
//		
//		Пока РезультатЗапроса.Следующий() Цикл
//			НоваяСтрока = Результат.Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);
//		КонецЦикла;
//		
//	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
